## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault.current_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "current_key" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "vj-rcm-dev-kv"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "vj-rcm-dev-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # data.azurerm_key_vault_secret.current_adls_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "current_adls_secret" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "vj-adls-access-key-dev"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azuread_application.rcm_adb_app will be destroyed
  # (because azuread_application.rcm_adb_app is not in configuration)
  - resource "azuread_application" "rcm_adb_app" {
      - app_role_ids                   = {} -> null
      - client_id                      = "80cc7a10-a6d8-4063-88d1-37c0f02b5645" -> null
      - device_only_auth_enabled       = false -> null
      - display_name                   = "vj-rcm-dev-adb-app" -> null
      - fallback_public_client_enabled = false -> null
      - id                             = "/applications/8b7a367f-d8a5-43ee-9d4b-e4ff87d47c70" -> null
      - oauth2_permission_scope_ids    = {} -> null
      - oauth2_post_response_required  = false -> null
      - object_id                      = "8b7a367f-d8a5-43ee-9d4b-e4ff87d47c70" -> null
      - prevent_duplicate_names        = false -> null
      - publisher_domain               = "vijaykrishnavk94gmail.onmicrosoft.com" -> null
      - sign_in_audience               = "AzureADMyOrg" -> null
      - tags                           = [] -> null
        # (11 unchanged attributes hidden)

      - api {
          - known_client_applications      = [] -> null
          - mapped_claims_enabled          = false -> null
          - requested_access_token_version = 1 -> null
        }

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - optional_claims {
        }

      - public_client {
          - redirect_uris = [] -> null
        }

      - single_page_application {
          - redirect_uris = [] -> null
        }

      - web {
          - redirect_uris = [] -> null
            # (2 unchanged attributes hidden)

          - implicit_grant {
              - access_token_issuance_enabled = false -> null
              - id_token_issuance_enabled     = false -> null
            }
        }
    }

  # azuread_application_registration.rcm_adf_app will be destroyed
  # (because azuread_application_registration.rcm_adf_app is not in configuration)
  - resource "azuread_application_registration" "rcm_adf_app" {
      - client_id                              = "0ded3d3e-6bdb-44f7-bb7b-ddb70f1949ec" -> null
      - disabled_by_microsoft                  = "map[false:]" -> null
      - display_name                           = "vj-rcm-dev-adf-app" -> null
      - group_membership_claims                = [] -> null
      - id                                     = "/applications/f416c41e-b0f9-4202-a7cd-daa0a5aa7844" -> null
      - implicit_access_token_issuance_enabled = false -> null
      - implicit_id_token_issuance_enabled     = false -> null
      - object_id                              = "f416c41e-b0f9-4202-a7cd-daa0a5aa7844" -> null
      - publisher_domain                       = "vijaykrishnavk94gmail.onmicrosoft.com" -> null
      - requested_access_token_version         = 2 -> null
      - sign_in_audience                       = "AzureADMyOrg" -> null
        # (9 unchanged attributes hidden)
    }

  # azuread_application_registration.rcm_adls_app will be destroyed
  # (because azuread_application_registration.rcm_adls_app is not in configuration)
  - resource "azuread_application_registration" "rcm_adls_app" {
      - client_id                              = "95475fa5-46b2-4fc5-940d-383037bb6c56" -> null
      - disabled_by_microsoft                  = "map[false:]" -> null
      - display_name                           = "vj-rcm-dev-adls-app" -> null
      - group_membership_claims                = [] -> null
      - id                                     = "/applications/6ea2b8c9-cf07-4d8e-b20e-82011cefdc9b" -> null
      - implicit_access_token_issuance_enabled = false -> null
      - implicit_id_token_issuance_enabled     = false -> null
      - object_id                              = "6ea2b8c9-cf07-4d8e-b20e-82011cefdc9b" -> null
      - publisher_domain                       = "vijaykrishnavk94gmail.onmicrosoft.com" -> null
      - requested_access_token_version         = 2 -> null
      - sign_in_audience                       = "AzureADMyOrg" -> null
        # (9 unchanged attributes hidden)
    }

  # azuread_service_principal.azure_adf_sp will be destroyed
  # (because azuread_service_principal.azure_adf_sp is not in configuration)
  - resource "azuread_service_principal" "azure_adf_sp" {
      - account_enabled               = true -> null
      - alternative_names             = [] -> null
      - app_role_assignment_required  = false -> null
      - app_role_ids                  = {} -> null
      - app_roles                     = [] -> null
      - application_tenant_id         = "314aacf1-9610-4c50-bf5a-8ce5f8010819" -> null
      - client_id                     = "0ded3d3e-6bdb-44f7-bb7b-ddb70f1949ec" -> null
      - display_name                  = "vj-rcm-dev-adf-app" -> null
      - id                            = "/servicePrincipals/a1ca21ef-2507-4022-b5f3-a5f9c2970bba" -> null
      - notification_email_addresses  = [] -> null
      - oauth2_permission_scope_ids   = {} -> null
      - oauth2_permission_scopes      = [] -> null
      - object_id                     = "a1ca21ef-2507-4022-b5f3-a5f9c2970bba" -> null
      - owners                        = [] -> null
      - redirect_uris                 = [] -> null
      - service_principal_names       = [] -> null
      - sign_in_audience              = "AzureADMyOrg" -> null
      - tags                          = [] -> null
      - type                          = "Application" -> null
      - use_existing                  = true -> null
        # (7 unchanged attributes hidden)

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - features {
          - custom_single_sign_on_app = false -> null
          - enterprise_application    = false -> null
          - gallery_application       = false -> null
          - visible_to_users          = true -> null
        }

      - saml_single_sign_on {
            # (1 unchanged attribute hidden)
        }
    }

  # azuread_service_principal.azure_adls_sp will be destroyed
  # (because azuread_service_principal.azure_adls_sp is not in configuration)
  - resource "azuread_service_principal" "azure_adls_sp" {
      - account_enabled               = true -> null
      - alternative_names             = [] -> null
      - app_role_assignment_required  = false -> null
      - app_role_ids                  = {} -> null
      - app_roles                     = [] -> null
      - application_tenant_id         = "314aacf1-9610-4c50-bf5a-8ce5f8010819" -> null
      - client_id                     = "95475fa5-46b2-4fc5-940d-383037bb6c56" -> null
      - display_name                  = "vj-rcm-dev-adls-app" -> null
      - id                            = "/servicePrincipals/c8df4345-5fc6-42a6-975f-ba96526d3f73" -> null
      - notification_email_addresses  = [] -> null
      - oauth2_permission_scope_ids   = {} -> null
      - oauth2_permission_scopes      = [] -> null
      - object_id                     = "c8df4345-5fc6-42a6-975f-ba96526d3f73" -> null
      - owners                        = [] -> null
      - redirect_uris                 = [] -> null
      - service_principal_names       = [] -> null
      - sign_in_audience              = "AzureADMyOrg" -> null
      - tags                          = [] -> null
      - type                          = "Application" -> null
      - use_existing                  = true -> null
        # (7 unchanged attributes hidden)

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - features {
          - custom_single_sign_on_app = false -> null
          - enterprise_application    = false -> null
          - gallery_application       = false -> null
          - visible_to_users          = true -> null
        }

      - saml_single_sign_on {
            # (1 unchanged attribute hidden)
        }
    }

  # azurerm_data_factory_linked_service_data_lake_storage_gen2.rcm_adls_ls will be updated in-place
  ~ resource "azurerm_data_factory_linked_service_data_lake_storage_gen2" "rcm_adls_ls" {
        id                    = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.DataFactory/factories/vj-rcm-dev-adf/linkedservices/vj-rcm-dev-adls-ls"
        name                  = "vj-rcm-dev-adls-ls"
      ~ storage_account_key   = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault.rcm_kv will be updated in-place
  ~ resource "azurerm_key_vault" "rcm_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Decrypt",
                    "Encrypt",
                    "UnwrapKey",
                    "WrapKey",
                    "Verify",
                    "Sign",
                    "Purge",
                    "Release",
                    "Rotate",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                ]
                object_id               = "68469a57-c1fd-46d1-ba9c-c42616f8ea86"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "Purge",
                ]
                storage_permissions     = [
                    "Backup",
                    "Delete",
                    "DeleteSAS",
                    "Get",
                    "GetSAS",
                    "List",
                    "ListSAS",
                    "Purge",
                    "Recover",
                    "RegenerateKey",
                    "Restore",
                    "Set",
                    "SetSAS",
                    "Update",
                ]
                tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
            },
          - {
              - certificate_permissions = []
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "UnwrapKey",
                  - "WrapKey",
                ]
              - object_id               = "c8df4345-5fc6-42a6-975f-ba96526d3f73"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                ]
              - storage_permissions     = []
              - tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
                # (1 unchanged attribute hidden)
            },
          - {
              - certificate_permissions = []
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Decrypt",
                  - "Encrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Verify",
                  - "Sign",
                  - "Purge",
                ]
              - object_id               = "6f0da0b0-27bb-4601-a4ed-81d234b09d39"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
                # (1 unchanged attribute hidden)
            },
          - {
              - certificate_permissions = []
              - key_permissions         = [
                  - "Get",
                  - "List",
                  - "Update",
                  - "Create",
                  - "Import",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Decrypt",
                  - "Encrypt",
                  - "UnwrapKey",
                  - "WrapKey",
                  - "Verify",
                  - "Sign",
                  - "Purge",
                ]
              - object_id               = "a1ca21ef-2507-4022-b5f3-a5f9c2970bba"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                  - "Purge",
                ]
              - storage_permissions     = []
              - tenant_id               = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
                # (1 unchanged attribute hidden)
            },
        ]
        id                              = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv"
        name                            = "vj-rcm-dev-kv"
        tags                            = {}
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_access_policy.rcm-adf-mi will be destroyed
  # (because azurerm_key_vault_access_policy.rcm-adf-mi is not in configuration)
  - resource "azurerm_key_vault_access_policy" "rcm-adf-mi" {
      - id                 = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv/objectId/6f0da0b0-27bb-4601-a4ed-81d234b09d39" -> null
      - key_permissions    = [
          - "Get",
          - "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "Recover",
          - "Backup",
          - "Restore",
          - "Decrypt",
          - "Encrypt",
          - "UnwrapKey",
          - "WrapKey",
          - "Verify",
          - "Sign",
          - "Purge",
        ] -> null
      - key_vault_id       = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv" -> null
      - object_id          = "6f0da0b0-27bb-4601-a4ed-81d234b09d39" -> null
      - secret_permissions = [
          - "Get",
          - "List",
          - "Set",
          - "Delete",
          - "Recover",
          - "Backup",
          - "Restore",
          - "Purge",
        ] -> null
      - tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819" -> null
    }

  # azurerm_key_vault_access_policy.rcm-adf-principal will be destroyed
  # (because azurerm_key_vault_access_policy.rcm-adf-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "rcm-adf-principal" {
      - id                 = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv/objectId/a1ca21ef-2507-4022-b5f3-a5f9c2970bba" -> null
      - key_permissions    = [
          - "Get",
          - "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "Recover",
          - "Backup",
          - "Restore",
          - "Decrypt",
          - "Encrypt",
          - "UnwrapKey",
          - "WrapKey",
          - "Verify",
          - "Sign",
          - "Purge",
        ] -> null
      - key_vault_id       = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv" -> null
      - object_id          = "a1ca21ef-2507-4022-b5f3-a5f9c2970bba" -> null
      - secret_permissions = [
          - "Get",
          - "List",
          - "Set",
          - "Delete",
          - "Recover",
          - "Backup",
          - "Restore",
          - "Purge",
        ] -> null
      - tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819" -> null
    }

  # azurerm_key_vault_access_policy.rcm-adls-principal will be destroyed
  # (because azurerm_key_vault_access_policy.rcm-adls-principal is not in configuration)
  - resource "azurerm_key_vault_access_policy" "rcm-adls-principal" {
      - id                 = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv/objectId/c8df4345-5fc6-42a6-975f-ba96526d3f73" -> null
      - key_permissions    = [
          - "Get",
          - "List",
          - "UnwrapKey",
          - "WrapKey",
        ] -> null
      - key_vault_id       = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv" -> null
      - object_id          = "c8df4345-5fc6-42a6-975f-ba96526d3f73" -> null
      - secret_permissions = [
          - "Get",
          - "List",
        ] -> null
      - tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819" -> null
    }

  # databricks_service_principal.rcm_db_sp will be destroyed
  # (because databricks_service_principal.rcm_db_sp is not in configuration)
  - resource "databricks_service_principal" "rcm_db_sp" {
      - acl_principal_id           = "servicePrincipals/80cc7a10-a6d8-4063-88d1-37c0f02b5645" -> null
      - active                     = true -> null
      - allow_cluster_create       = false -> null
      - allow_instance_pool_create = false -> null
      - application_id             = "80cc7a10-a6d8-4063-88d1-37c0f02b5645" -> null
      - databricks_sql_access      = false -> null
      - display_name               = "vj-rcm-dev-adb-app" -> null
      - home                       = "/Users/80cc7a10-a6d8-4063-88d1-37c0f02b5645" -> null
      - id                         = "118512310069643" -> null
      - repos                      = "/Repos/80cc7a10-a6d8-4063-88d1-37c0f02b5645" -> null
      - workspace_access           = false -> null
    }

  # time_rotating.month will be destroyed
  # (because time_rotating.month is not in configuration)
  - resource "time_rotating" "month" {
      - day              = 10 -> null
      - hour             = 0 -> null
      - id               = "2025-01-24T00:43:49Z" -> null
      - minute           = 43 -> null
      - month            = 3 -> null
      - rfc3339          = "2025-01-24T00:43:49Z" -> null
      - rotation_days    = 45 -> null
      - rotation_rfc3339 = "2025-03-10T00:43:49Z" -> null
      - second           = 49 -> null
      - unix             = 1741567429 -> null
      - year             = 2025 -> null
    }

Plan: 0 to add, 2 to change, 10 to destroy.
```
</details>